tommyys/obdgauge/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
# 8MB embedded PSRAM, octal (esptool reports "Embedded PSRAM 8MB (AP_3v3)").
# Needed for the 466x466 framebuffer: ~424KB per frame.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# This board has no USB-to-UART bridge: the only link to the Mac is the
# ESP32-S3's native USB-Serial/JTAG. IDF defaults the console to UART0, whose
# pins go nowhere here, so printf output is invisible without this.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_COMPILER_CXX_EXCEPTIONS=n

# Fonts for the gauge readouts. LVGL ships none enabled by default beyond 14.
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# On, and set to PANIC, because the failure this firmware actually hits is a
# hang rather than a crash: LVGL's allocator spins forever when its pool runs
# out (see CONFIG_LV_MEM_SIZE_KILOBYTES below), and the board then goes silent
# and needs a physical replug with nothing to show for it. With the watchdog on
# the same hang prints a backtrace naming the spinning function instead, which
# is what found that bug after a day of bisecting binaries.
#
# It was off because play_boot_clip() paces itself off the wall clock and never
# yields for the 2.5 s the splash lasts, so the idle task would trip the 5 s
# default every boot. 10 s clears the splash with room to spare.
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_PANIC=y

# Real FPS from the display pipeline, so frame-rate questions are answered with
# a number rather than an opinion. Costs <2us per frame.
CONFIG_ESP_LVGL_ADAPTER_ENABLE_FPS_STATS=y

# LVGL will not refresh more often than this, so the default 33ms pinned the UI
# at 30fps regardless of how cheap frames became.
CONFIG_LV_DEF_REFR_PERIOD=16

# lv_snapshot renders a view into a buffer of our own. The carousel slide needs
# two such buffers -- the outgoing and incoming views -- so that sliding costs a
# memcpy and a blit per frame instead of re-rendering both views ten bands at a
# time. Off by default in LVGL.
CONFIG_LV_USE_SNAPSHOT=y

# Waveshare's own examples for this board (examples/esp-idf/02_lvgl_demo_v9,
# 04_Immersive_block) build for speed; we were still on the IDF debug defaults.
# Measured on the board 2026-08-22: the 434 KB-per-frame flash read went
# 68ms -> 47ms (esp_partition_read) and 42ms -> 29ms (mmap+memcpy). The byte
# swap barely moved (13ms -> 12ms) -- it is PSRAM-bandwidth bound, not CPU
# bound. The blit went 37ms -> 32ms here and then to 19ms once the vendored BSP
# raised the panel QSPI clock to 80 MHz, which is the change that mattered.
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# QIO doubles the flash data lines. IDF still writes "dio" into the image
# header for QIO (esptool_py/Kconfig.projbuild) and the 2nd-stage bootloader
# switches at runtime, so the flash command printing --flash_mode dio is
# expected and not a sign this failed.
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
# At the 100 Hz default tick, LV_DEF_REFR_PERIOD=16 rounds to 20ms, so the
# refresh cadence was uneven regardless of frame cost.
CONFIG_FREERTOS_HZ=1000
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2

# The tacho's dial numbering. 13px in the simulator's 260-unit drawing is 23px
# here, and 24 is the nearest size LVGL ships.
CONFIG_LV_FONT_MONTSERRAT_24=y

# LVGL allocates its objects AND its temporary render buffers from one fixed
# pool, and the builtin allocator's failure path is an assert that spins
# forever -- so an over-full pool does not degrade, it hangs the draw task with
# no message. The eight views' objects left ~19 KB free at 64 KB, and a
# full-screen lv_snapshot (which the carousel slide takes) needs more than that
# for its arc masks: the tacho's heat band alone is 54 arcs, each allocating a
# radius mask, across two draw-unit threads. That is what hung every swipe.
#
# 96, down from 128 on 2026-08-28, because three things now want the same
# internal RAM and this pool is the only one with measured slack:
#   - the BT controller's contiguous 30,720 bytes (radio_init, at boot),
#   - the slide's 29,824-byte DMA band buffer (slide.cpp, on first swipe),
#   - the panel driver's own SPI transfers.
# With the pool at 128 KB the radio started but only 6,207 bytes of DMA RAM
# were left, so the first swipe would have printed "band buffer UNAVAILABLE".
# The pool reports 33% used with 84 KB free at rest, so 32 KB of it is slack;
# at 96 KB there is still ~52 KB free at rest, against the ~19 KB that was
# actually hanging swipes at 64 KB. That margin is the reason for 96 and not
# 64. The "lv pool %% used" figure on the ui: line is how to tell if this was
# cut too far -- if it climbs toward 100%, swipes hang with no message.
CONFIG_LV_MEM_SIZE_KILOBYTES=96

# --- Task 14: BLE link to the vLinker -------------------------------------
# The ESP32-S3 has no Bluetooth Classic, so the adapter is reached over BLE
# (SPEC.md section 3). NimBLE rather than Bluedroid: this firmware is a GATT
# *client* and nothing else, which is the case NimBLE is small for.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# Central only. The gauge scans and connects; nothing ever connects to it, so
# the advertising and GATT-server roles are dead weight.
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
# One link, ever: the vLinker.
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
# The ELM327 replies to 0100-style requests in one or two 20-byte notifications,
# but a full supported-PID sweep reply can be longer; a 128-byte ATT MTU keeps
# a whole reply in one packet on adapters that will negotiate it.
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=128
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y
# NimBLE's buffers live in PSRAM, not internal RAM. Measured 2026-08-27: with
# them internal, the panel driver started failing draws outright --
# "spi transmit (queue) color failed / ESP_ERR_NO_MEM" every few frames, which
# on the glass is a torn, half-drawn gauge. The SPI DMA the display depends on
# can only come from internal RAM; the BLE host's buffers have no such
# requirement, so they are the ones that move.
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y

# --- The BT controller could not start once the recorder took its RAM -------
# Symptom on the board (2026-08-28, drive-recording merged): every 10 s
#   E BLE_INIT: Malloc failed / esp_bt_controller_init -4 / NimBLE would not
#   start, with the ui: line reporting "dma free 20143".
# The same sdkconfig linked and ran in the car on 2026-08-27, so nothing here
# regressed -- the recorder simply added ~30 KB of permanently-held internal
# DRAM on top of it (two task stacks, the flight log's twin 3 KB buffers, the
# sample queue, the LIST table), and the controller's own allocation is
# internal-only and cannot move to PSRAM.
#
# The LVGL pool is the biggest internal object in the image, but it is NOT the
# one to cut: see CONFIG_LV_MEM_SIZE_KILOBYTES above -- 64 KB is what hung
# every swipe. So the internal RAM comes from two places instead.
#
# 1. Stop sending mid-size allocations to internal RAM. The default sends
#    everything under 16 KB internal first; at 4 KB, anything larger goes to
#    PSRAM. Callers that genuinely need internal or DMA memory (the panel's SPI
#    buffers) ask for it explicitly with heap_caps_malloc and are unaffected.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
# 2. Reserve more internal RAM for the callers that can only use internal --
#    which is exactly what the BT controller is.
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
#
# And shrink what the controller asks for. This is a central with one link to
# one adapter, not a scanner of crowds:
# - MAX_ACT 6 -> 2: one scan activity plus one connection is all it ever runs.
# - the duplicate-scan cache and the advert flow-control queue are sized for a
#   busy room; a garage has the vLinker in it.
# - 50 alarms and a 12-entry whitelist are likewise for a device with peers.
CONFIG_BT_CTRL_BLE_MAX_ACT=2
CONFIG_BT_CTRL_SCAN_DUPL_CACHE_SIZE=20
CONFIG_BT_CTRL_BLE_ADV_REPORT_FLOW_CTRL_NUM=20
CONFIG_BT_ALARM_MAX_NUM=20
CONFIG_BT_NIMBLE_WHITELIST_SIZE=1

# Still 1 KB short after the above: the controller asks for 0x7800 = 30,720
# bytes and only 29,711 were free, and on failure it now asserts
# ("BLE assert emi.c 164") and reboots the gauge instead of returning -4. So
# cut what the controller is asked to support. None of these are used by a
# central that talks to one ELM327 adapter:
# - BLE 5.0 / extended scanning: the vLinker advertises legacy. Ext adv and
#   ext scan carry their own controller buffers.
# - Direct Test Mode is a radio-certification feature.
# - the advert-report flow-control queue cannot be sized below 100 entries, so
#   it goes off entirely rather than being trimmed.
CONFIG_BT_NIMBLE_50_FEATURE_SUPPORT=n
CONFIG_BT_NIMBLE_EXT_SCAN=n
CONFIG_BT_CTRL_DTM_ENABLE=n
CONFIG_BT_CTRL_BLE_ADV_REPORT_FLOW_CTRL_SUPP=n

# The UI loop moves to core 1, away from the radio. app_main defaults to core 0,
# which is also where the BT controller and the NimBLE host run
# (CONFIG_BT_NIMBLE_PINNED_TO_CORE=0, and the controller cannot move). Measured
# on the board 2026-08-28, the moment the radio actually started working: while
# scanning, the display fell from 40 fps to 0-2 fps and stayed there. The UI
# loop takes bsp_display_lock() to update its widgets, the NimBLE host at its
# much higher priority then preempts it on the same core, and the LVGL task --
# which needs that same lock to render -- waits behind a task that is not being
# allowed to run. So the gauge froze while looking for the adapter, which in the
# car is every drive until it connects, and forever if it never does.
# The recorder's task and live_link's poll task stay on core 0 deliberately: a
# flash erase must not land on the display's core.
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU1=y
